app/Controllers/Horario.php

SELECT *
FROM `Horario`
---
    public function ver()
    {
        $session=session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=0){
             return redirect()->to(base_url('/login'));
        }
        $data1 ['nombre']=$session->get('alias');
        $horarioM=model('HorarioM');
        $data['horario']=$horarioM->findAll();