app/Controllers/Socio.php

    public function ver()
    { $session=session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=0){
             return redirect()->to(base_url('/login'));
        }
        $data1 ['nombre']=$session->get('alias');
        $socioM=model('SocioM');
        $data['socios']=$socioM->findAll();
---
SELECT *
FROM `socio`