app/Controllers/Usuario.php

    public function ver()
    {
        $session=session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=0){
             return redirect()->to(base_url('/login'));
        }
        $data1 ['nombre']=$session->get('alias');
        $usuarioM=model('UsuarioM');
        $data['usuario']=$usuarioM->findAll();
---
SELECT *
FROM `Usuario`